RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_rcu.c
/*!
    \brief      IRC64M clock frequency monitor range configuration (API_ID(0x0057U))
    \param[in]  range: IRC64M clock frequency monitor configuration
                only one parameter can be selected which is shown as below:
      \arg        RCU_IRC64MCKFMC_5_PERCENT: the IRC64M clock frequency monitoring range is ±5%
      \arg        RCU_IRC64MCKFMC_10_PERCENT: the IRC64M clock frequency monitoring range is ±10%
      \arg        RCU_IRC64MCKFMC_15_PERCENT: the IRC64M clock frequency monitoring range is ±15%
      \arg        RCU_IRC64MCKFMC_20_PERCENT: the IRC64M clock frequency monitoring range is ±20%
    \param[out] none
    \retval     none
*/
void rcu_irc64m_freq_monitor_config(uint32_t range)
{
    uint32_t reg;

    reg = RCU_CKFMCFG0;
    reg &= ~RCU_CKFMCFG0_IRC64MCKFMC;
    RCU_CKFMCFG0 = reg | (range & RCU_CKFMCFG0_IRC64MCKFMC);
}

/*!
    \brief      LPIRC4M clock frequency monitor range configuration (API_ID(0x0058U))
    \param[in]  range: LPIRC4M clock frequency monitor configuration
                only one parameter can be selected which is shown as below:
      \arg        RCU_LPIRC4MCKFMC_5_PERCENT: the LPIRC4M clock frequency monitoring range is ±5%
      \arg        RCU_LPIRC4MCKFMC_10_PERCENT: the LPIRC4M clock frequency monitoring range is ±10%
      \arg        RCU_LPIRC4MCKFMC_15_PERCENT: the LPIRC4M clock frequency monitoring range is ±15%
      \arg        RCU_LPIRC4MCKFMC_20_PERCENT: the LPIRC4M clock frequency monitoring range is ±20%
    \param[out] none
    \retval     none
*/
void rcu_lpirc4m_freq_monitor_config(uint32_t range)
{
    uint32_t reg;

    reg = RCU_CKFMCFG0;
    reg &= ~RCU_CKFMCFG0_LPIRC4MCKFMC;
    RCU_CKFMCFG0 = reg | (range & RCU_CKFMCFG0_LPIRC4MCKFMC);
}

/*!
    \brief      HXTAL clock frequency monitor threshold configuration (API_ID(0x0059U))
    \param[in]  lthreshold: low frequency threshold configuration
      \arg        0x00 - 0x7ff
    \param[in]  hthreshold: high frequency threshold configuration
      \arg        0x00 - 0x7ff
    \param[out] none
    \retval     none
*/
void rcu_hxtal_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold)
{
    uint32_t reg;

    reg = RCU_CKFMCFG1;
    reg &= ~(RCU_CKFMCFG1_HXTALCKFMIN | RCU_CKFMCFG1_HXTALCKFMAX);
    RCU_CKFMCFG1 = reg | ((lthreshold << 12U) & RCU_CKFMCFG1_HXTALCKFMIN) | ((hthreshold << 1U) & RCU_CKFMCFG1_HXTALCKFMAX);
}

/*!
    \brief      PLL0P clock frequency monitor threshold configuration (API_ID(0x005AU))
    \param[in]  lthreshold: low frequency threshold configuration
      \arg        0x00 - 0x7ff
    \param[in]  hthreshold: high frequency threshold configuration
      \arg        0x00 - 0x7ff
    \param[out] none
    \retval     none
*/
void rcu_pll0p_monitor_threshold_config(uint32_t lthreshold, uint32_t hthreshold)
{
    uint32_t reg;

    reg = RCU_CKFMCFG2;
    reg &= ~(RCU_CKFMCFG2_PLL0PCKFMIN | RCU_CKFMCFG2_PLL0PCKFMAX);
    RCU_CKFMCFG2 = reg | ((lthreshold << 12U) & RCU_CKFMCFG2_PLL0PCKFMIN) | ((hthreshold << 1U) & RCU_CKFMCFG2_PLL0PCKFMAX);
}

/*!
    \brief    get the system clock, bus and peripheral clock frequency (API_ID(0x005BU))
    \param[in]  clock: the clock frequency which to get
                only one parameter can be selected which is shown as below:
      \arg        CK_SYS: system clock frequency
      \arg        CK_AHB: AHB clock frequency
      \arg        CK_APB1: APB1 clock frequency
      \arg        CK_APB2: APB2 clock frequency
      \arg        CK_APB3: APB3 clock frequency
      \arg        CK_APB4: APB4 clock frequency
      \arg        CK_PLL0P: PLL0P clock frequency
      \arg        CK_PLL0Q: PLL0Q clock frequency
      \arg        CK_PLL0R: PLL0R clock frequency
      \arg        CK_PLL1P: PLL1P clock frequency
      \arg        CK_PLL1Q: PLL1Q clock frequency
      \arg        CK_PLL1R: PLL1R clock frequency
      \arg        CK_PLL2P: PLL2P clock frequency
      \arg        CK_PLL2Q: PLL2Q clock frequency
      \arg        CK_PLL2R: PLL2R clock frequency
      \arg        CK_PER: PER clock frequency
      \arg        CK_USART0: USART0 clock frequency
      \arg        CK_USART1: USART1 clock frequency
      \arg        CK_USART2: USART2 clock frequency
      \arg        CK_USART5: USART5 clock frequency
      \arg        CK_IRC64MDIV: IRC64MDIV clock frequency
      \arg        CK_HXTAL: HXTAL clock frequency
      \arg        CK_LPIRC4M: LPIRC4M clock frequency
    \param[out] none
    \retval     uint32_t: clock frequency of system, AHB, APB1, APB2, APB3, APB4, PLL, PER, USART, IRC64MDIV, HXTAL, LPIRC4M
*/
uint32_t rcu_clock_freq_get(rcu_clock_freq_enum clock)
{
    uint32_t sws, ck_freq = 0U, irc64mdiv_freq = 0U, fracn = 0U;
    uint32_t cksys_freq, ahb_freq, apb1_freq, apb2_freq, apb3_freq, apb4_freq;
    uint32_t pll0p_freq, pll0q_freq, pll0r_freq, pll1p_freq, pll1q_freq, pll1r_freq, pll2p_freq, pll2q_freq, pll2r_freq, per_freq, persel;
    uint32_t pll0psc, pll1psc, pll2psc, pll0n, pll1n, pll2n, pllsel, pll0p, pll0q, pll0r, pll1p, pll1q, pll1r, pll2p, pll2q, pll2r, ck_src, idx, clk_exp;
    uint32_t usart_freq = 0U;

    /* exponent of AHB, APB1 and APB2 clock divider */
    const uint8_t ahb_exp[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};
    const uint8_t apb1_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};
    const uint8_t apb2_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};
    const uint8_t apb3_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};
    const uint8_t apb4_exp[8] = {0, 0, 0, 0, 1, 2, 3, 4};

    irc64mdiv_freq = rcu_irc64mdiv_freq_get();
    sws = GET_BITS(RCU_CFG0, 2, 3);

    switch(sws) {
    /* IRC64MDIV is selected as CK_SYS */
    case SEL_IRC64MDIV:
        cksys_freq = irc64mdiv_freq;
        break;
    /* LPIRC4M is selected as CK_SYS */
    case SEL_LPIRC4M:
        cksys_freq = LPIRC4M_VALUE;
        break;
    /* HXTAL is selected as CK_SYS */
    case SEL_HXTAL:
        cksys_freq = HXTAL_VALUE;
        break;
    /* PLL0P is selected as CK_SYS */
    case SEL_PLL0P:
        /* get the value of PLL0PSC[5:0] */
        pll0psc = GET_BITS(RCU_PLL0, 0U, 5U);
        pll0n = (GET_BITS(RCU_PLL0, 6U, 14U) + 1U);
        pll0p = (GET_BITS(RCU_PLL0, 16U, 22U) + 1U);

        if((RCU_PLL0FRA & RCU_PLL0FRA_PLL0FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL0FRA, 0U, 12U);
        }

        /* PLL clock source selection, HXTAL, IRC64MDIV or LPIRC4M */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

