RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Source/gd32h77x_78x_rcu.c
        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        if(pll1psc != 0U) {
            if((RCU_PLLADDCTL & RCU_PLLADDCTL_PLL1QEN) != 0U) {
                pll1q_freq = rcu_pll_clock_freq_cal(ck_src, pll1psc, pll1n, fracn, pll1q);
            }
        }

        ck_freq = pll1q_freq;
        break;
    case CK_PLL2P:
        pll2p_freq = 0U;
        /* calculate pll2p clock frequency */
        pll2psc = GET_BITS(RCU_PLL2, 0U, 5U);
        pll2n = (GET_BITS(RCU_PLL2, 6U, 14U) + 1U);
        pll2p = (GET_BITS(RCU_PLL2, 16U, 22U) + 1U);

        if((RCU_PLL2FRA & RCU_PLL2FRA_PLL2FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL2FRA, 0U, 12U);
        }

        /* PLL clock source selection (HXTAL, IRC64MDIV or LPIRC4M) */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        if(pll2psc != 0U) {
            if((RCU_PLLADDCTL & RCU_PLLADDCTL_PLL2PEN) != 0U) {
                pll2p_freq = rcu_pll_clock_freq_cal(ck_src, pll2psc, pll2n, fracn, pll2p);
            }
        }

        ck_freq = pll2p_freq;
        break;
    case CK_PLL2R:
        pll2r_freq = 0U;
        /* calculate pll2r clock frequency */
        pll2psc = GET_BITS(RCU_PLL2, 0U, 5U);
        pll2n = (GET_BITS(RCU_PLL2, 6U, 14U) + 1U);
        pll2r = (GET_BITS(RCU_PLL2, 24U, 30U) + 1U);

        if((RCU_PLL2FRA & RCU_PLL2FRA_PLL2FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL2FRA, 0U, 12U);
        }

        /* PLL clock source selection (HXTAL, IRC64MDIV or LPIRC4M) */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        if(pll2psc != 0U) {
            if((RCU_PLLADDCTL & RCU_PLLADDCTL_PLL2REN) != 0U) {
                pll2r_freq = rcu_pll_clock_freq_cal(ck_src, pll2psc, pll2n, fracn, pll2r);
            }
        }

        ck_freq = pll2r_freq;
        break;
    case CK_PLL2Q:
        pll2q_freq = 0U;
        /* calculate pll2q clock frequency */
        pll2psc = GET_BITS(RCU_PLL2, 0U, 5U);
        pll2n = (GET_BITS(RCU_PLL2, 6U, 14U) + 1U);
        pll2q = (GET_BITS(RCU_PLLADDCTL, 16U, 22U) + 1U);

        if((RCU_PLL2FRA & RCU_PLL2FRA_PLL2FRAEN) != 0U) {
            fracn = GET_BITS(RCU_PLL2FRA, 0U, 12U);
        }

        /* PLL clock source selection (HXTAL, IRC64MDIV or LPIRC4M) */
        pllsel = (RCU_PLLALL & RCU_PLLALL_PLLSEL);

        if(RCU_PLLSRC_HXTAL == pllsel) {
            ck_src = HXTAL_VALUE;
        } else if(RCU_PLLSRC_IRC64MDIV == pllsel) {
            ck_src = irc64mdiv_freq;
        } else {
            ck_src = LPIRC4M_VALUE;
        }

        if(pll2psc != 0U) {
            if((RCU_PLLADDCTL & RCU_PLLADDCTL_PLL2QEN) != 0U) {
                pll2q_freq = rcu_pll_clock_freq_cal(ck_src, pll2psc, pll2n, fracn, pll2q);
            }
        }

        ck_freq = pll2q_freq;
        break;
    case CK_PER:
        /* calculate peripheral clock frequency */
        persel = (RCU_CFG1 & RCU_CFG1_PERSEL);

        if(RCU_PERSRC_HXTAL == persel) {
            per_freq = HXTAL_VALUE;
        } else if(RCU_PERSRC_IRC64MDIV == persel) {
            per_freq = irc64mdiv_freq;
        } else {
            per_freq = LPIRC4M_VALUE;
        }

        ck_freq = per_freq;
        break;
    case CK_USART0:
        /* calculate USART0 clock frequency */
        if(RCU_USARTSRC_APB == (RCU_CFG1 & RCU_CFG1_USART0SEL)) {
            usart_freq = apb2_freq;
        } else if(RCU_USARTSRC_AHB == (RCU_CFG1 & RCU_CFG1_USART0SEL)) {
            usart_freq = ahb_freq;
        } else if(RCU_USARTSRC_LXTAL == (RCU_CFG1 & RCU_CFG1_USART0SEL)) {
            usart_freq = LXTAL_VALUE;
        } else if(RCU_USARTSRC_IRC64MDIV == (RCU_CFG1 & RCU_CFG1_USART0SEL)) {
            usart_freq = irc64mdiv_freq;
        } else {
        }

        ck_freq = usart_freq;
        break;
    case CK_USART1:
        /* calculate USART1 clock frequency */
        if((RCU_USARTSRC_APB << 18U) == (RCU_CFG1 & RCU_CFG1_USART1SEL)) {
            usart_freq = apb1_freq;
        } else if((RCU_USARTSRC_AHB << 18U) == (RCU_CFG1 & RCU_CFG1_USART1SEL)) {
            usart_freq = ahb_freq;
        } else if((RCU_USARTSRC_LXTAL << 18U) == (RCU_CFG1 & RCU_CFG1_USART1SEL)) {
            usart_freq = LXTAL_VALUE;
        } else if((RCU_USARTSRC_IRC64MDIV << 18U) == (RCU_CFG1 & RCU_CFG1_USART1SEL)) {
            usart_freq = irc64mdiv_freq;
        } else {
        }

        ck_freq = usart_freq;
        break;
    case CK_USART2:
        /* calculate USART2 clock frequency */
        if((RCU_USARTSRC_APB << 20U) == (RCU_CFG1 & RCU_CFG1_USART2SEL)) {
            usart_freq = apb1_freq;
        } else if((RCU_USARTSRC_AHB << 20U) == (RCU_CFG1 & RCU_CFG1_USART2SEL)) {
            usart_freq = ahb_freq;
        } else if((RCU_USARTSRC_LXTAL << 20U) == (RCU_CFG1 & RCU_CFG1_USART2SEL)) {
            usart_freq = LXTAL_VALUE;
        } else if((RCU_USARTSRC_IRC64MDIV << 20U) == (RCU_CFG1 & RCU_CFG1_USART2SEL)) {
            usart_freq = irc64mdiv_freq;
        } else {
        }

        ck_freq = usart_freq;
        break;
    case CK_USART5:
        /* calculate USART5 clock frequency */
        if((RCU_USARTSRC_APB << 22U) == (RCU_CFG1 & RCU_CFG1_USART5SEL)) {
            usart_freq = apb2_freq;
        } else if((RCU_USARTSRC_AHB << 22U) == (RCU_CFG1 & RCU_CFG1_USART5SEL)) {
            usart_freq = ahb_freq;
        } else if((RCU_USARTSRC_LXTAL << 22U) == (RCU_CFG1 & RCU_CFG1_USART5SEL)) {
            usart_freq = LXTAL_VALUE;
        } else if((RCU_USARTSRC_IRC64MDIV << 22U) == (RCU_CFG1 & RCU_CFG1_USART5SEL)) {
            usart_freq = irc64mdiv_freq;
        } else {
        }

        ck_freq = usart_freq;
        break;
    case CK_IRC64MDIV:
        ck_freq = irc64mdiv_freq;
        break;
    case CK_HXTAL:
        ck_freq = HXTAL_VALUE;
        break;
    case CK_LPIRC4M:
        ck_freq = LPIRC4M_VALUE;
        break;
    default:
        break;
    }

    return ck_freq;
}

/*!
    \brief      get the clock stabilization and failure, peripheral reset and clock frequency failure flags (API_ID(0x005CU))
    \param[in]  flag: the clock stabilization and peripheral reset flags, refer to rcu_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        RCU_FLAG_IRC64MSTB: IRC64M stabilization flag
      \arg        RCU_FLAG_HXTALSTB: HXTAL stabilization flag
      \arg        RCU_FLAG_PLL0STB: PLL0 stabilization flag
      \arg        RCU_FLAG_PLL1STB: PLL1 stabilization flag
      \arg        RCU_FLAG_PLL2STB: PLL2 stabilization flag
      \arg        RCU_FLAG_LXTALSTB: LXTAL stabilization flag
      \arg        RCU_FLAG_IRC32KSTB: IRC32K stabilization flag
      \arg        RCU_FLAG_IRC48MSTB: IRC48M stabilization flag
      \arg        RCU_FLAG_LPIRC4MSTB: LPIRC4M stabilization flag
      \arg        RCU_FLAG_PLLUSBHS0STB: PLLUSBHS0 stabilization flag
      \arg        RCU_FLAG_LCKMD: LXTAL clock failure detection flags
      \arg        RCU_FLAG_BORRST: BOR reset flags
      \arg        RCU_FLAG_EPRST: external PIN reset flag
      \arg        RCU_FLAG_PORRST: Power reset flag
      \arg        RCU_FLAG_SWRST: software reset flag
      \arg        RCU_FLAG_FWDGTRST: free watchdog timer reset flag
      \arg        RCU_FLAG_WWDGTRST: window watchdog timer reset flag
      \arg        RCU_FLAG_LPRST: low-power reset flag
      \arg        RCU_FLAG_IRC64MCKFF: IRC64M clock frequency failure flag
      \arg        RCU_FLAG_LPIRC4MCKFF: LPIRC4M clock frequency failure flag
      \arg        RCU_FLAG_HXTALCKFF: HXTAL clock frequency failure flag
      \arg        RCU_FLAG_PLL0PCKFF: PLL0P clock frequency failure flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus rcu_flag_get(rcu_flag_enum flag)
{
    FlagStatus status;

    /* get the rcu flag */
    if(RESET != (RCU_REG_VAL(flag) & BIT(RCU_BIT_POS(flag)))) {
        status = SET;
    } else {
        status = RESET;
    }

